#include "Graph.h"

const char* matrix =
        "0, 10, 20, 8, 0, 0, 0, 0, 0, 0\n"
        "0, 0, 0, 16, 16, 0, 0, 0, 0, 0\n"
        "0, 0, 0, 0, 0, 0, 11, 0, 0, 0\n"
        "0, 0, 0, 0, 0, 0, 4, 0, 0, 0\n"
        "0, 0, 0, 0, 0, 9, 0, 0, 0, 0\n"
        "0, 0, 0, 0, 0, 0, 0, 0, -30, 0\n" // -30 задает отрицательный цикл
        "0, 0, 0, 0, 0, 31, 0, 3, 0, 0\n"
        "0, 0, 2, 0, 0, 0, 0, 0, 0, 34\n"
        "0, 0, 0, 0, 17, 0, 0, 0, 0, 0\n"
        "0, 0, 0, 0, 0, 0, 30, 0, 42, 0\n";

int main() {
    Graph graph(10);
    graph.initialization(matrix);
    graph.print();

    // Алгоритм Дейкстры
    dijkstra(graph, 0);

    // Алгоритм Беллмана-Форда
    BF(graph, 0);

    // Алгоритм Флойда-Уоршелла
    FU(graph);

    // Алгоритм Прима
    primMST(graph);

    // Алгоритм Крускала
    kruskalMST(graph);
}
